[
    {
        "name": "Harper Lee",
        "age": "89",
        "nationality": "American",
        "gender": "Female",
        "number_of_publications": "2",
        "id": 1,
        "biography": "Nelle Harper Lee (April 28, 1926 – February 19, 2016) was an American novelist. She penned the 1960 novel To Kill a Mockingbird that won the 1961 Pulitzer Prize and became a classic of modern American literature. Lee received numerous accolades and honorary degrees, including the Presidential Medal of Freedom in 2007 which was awarded for her contribution to literature.[1][2][3] She assisted her close friend Truman Capote in his research for the book In Cold Blood (1966).[4] Capote was the basis for the character Dill Harris in To Kill a Mockingbird.",
        "portrait": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/Photo_portrait_of_Harper_Lee_%28To_Kill_a_Mockingbird_dust_jacket%2C_1960%29.jpg/435px-Photo_portrait_of_Harper_Lee_%28To_Kill_a_Mockingbird_dust_jacket%2C_1960%29.jpg"
    },
  
    {
        "name": "F. Scott Fitzgerald",
        "age": "44",
        "nationality": "American",
        "gender": "Male",
        "number_of_publications": "172",
        "id":  2,
        "biography": "Francis Scott Key Fitzgerald (September 24, 1896 – December 21, 1940) was an American novelist, essayist, and short story writer. He is best known for his novels depicting the flamboyance and excess of the Jazz Age—a term he popularized in his short story collection Tales of the Jazz Age. During his lifetime, he published four novels, four story collections, and 164 short stories. Although he achieved temporary popular success and fortune in the 1920s, Fitzgerald received critical acclaim only after his death and is now widely regarded as one of the greatest American writers of the 20th century.",
        "portrait": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/F._Scott_Fitzgerald_%281929_photo_portrait_by_Nickolas_Muray%29_Cropped.jpg/388px-F._Scott_Fitzgerald_%281929_photo_portrait_by_Nickolas_Muray%29_Cropped.jpg"
    },
  
    {
        "name": "Mary Shelley",
        "age": "53",
        "nationality": "English",
        "gender": "Female",
        "number_of_publications": "8",
        "id":  3,
        "biography": "Mary Wollstonecraft Shelley (UK: /ˈwʊlstənkrɑːft/; née Godwin; 30 August 1797 – 1 February 1851) was an English novelist who wrote the Gothic novel Frankenstein; or, The Modern Prometheus (1818), which is considered an early example of science fiction and one of her best-known works.[2] She also edited and promoted the works of her husband, the Romantic poet and philosopher Percy Bysshe Shelley. Her father was the political philosopher William Godwin and her mother was the philosopher and women's rights advocate Mary Wollstonecraft.",
        "portrait": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Mary_Wollstonecraft_Shelley_Rothwell.tif/lossy-page1-394px-Mary_Wollstonecraft_Shelley_Rothwell.tif.jpg"
    }
  ]
  