[
    {'batchcomplete': '', 'query': {'pages': {'984': {'pageid': 984, 'ns': 0, 'title': 'Agatha Christie', 'extract': 'Dame Agatha Mary Clarissa Christie, Lady Mallowan,  (née Miller; 15 September 1890 – 12 January 1976) was an English writer known for her 66 detective novels and 14 short story collections, particularly those revolving around fictional detectives Hercule Poirot and Miss Marple. She also wrote the world\'s longest-running play, the murder mystery The Mousetrap, which has been performed in the West End since 1952. A writer during the "Golden Age of Detective Fiction", Christie has been called the "Queen of Crime". She also wrote six novels under the pseudonym Mary Westmacott. In 1971, she was made a Dame (DBE) by Queen Elizabeth II for her contributions to literature. Guinness World Records lists Christie as the best-selling fiction writer of all time, her novels having sold more than two billion copies.\nChristie was born into a wealthy upper middle class family in Torquay, Devon, and was largely home-schooled. She was initially an unsuccessful writer with six consecutive rejections, but this changed in 1920 when The Mysterious Affair at Styles, featuring detective Hercule Poirot, was published. Her first husband was Archibald Christie; they married in 1914 and had one child before divorcing in 1928. Following the breakdown of her marriage and the death of her mother in 1926 she made international headlines by going missing for eleven days. During both World Wars, she served in hospital dispensaries, acquiring a thorough knowledge of the poisons that featured in many of her novels, short stories, and plays. Following her marriage to archaeologist Max Mallowan in 1930, she spent several months each year on digs in the Middle East and used her first-hand knowledge of this profession in her fiction.\nAccording to UNESCO\'s Index Translationum, she remains the most-translated individual author. Her novel And Then There Were None is one of the top-selling books of all time, with approximately 100 million copies sold. Christie\'s stage play The Mousetrap holds the world record for the longest initial run. It opened at the Ambassadors Theatre in the West End on 25 November 1952, and by September 2018 there had been more than 27,
                    500 performances. The play was temporarily closed in March 2020 because of COVID-19 lockdowns in London before it reopened in May 2021.\nIn 1955, Christie was the first recipient of the Mystery Writers of America\'s Grand Master Award. Later that year, Witness for the Prosecution received an Edgar Award for best play. In 2013, she was voted the best crime writer and The Murder of Roger Ackroyd the best crime novel ever by 600 professional novelists of the Crime Writers\' Association. In September 2015, And Then There Were None was named the "World\'s Favourite Christie" in a vote sponsored by the author\'s estate. Many of Christie\'s books and short stories have been adapted for television, radio, video games, and graphic novels. More than 30 feature films are based on her work.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'32897': {'pageid': 32897, 'ns': 0, 'title': 'William Shakespeare', 'extract': 'William Shakespeare (bapt. 26 April 1564 – 23 April 1616) was an English playwright, poet and actor. He is widely regarded as the greatest writer in the English language and the world\'s pre-eminent dramatist. He is often called England\'s national poet and the "Bard of Avon" (or simply "the Bard"). His extant works, including collaborations, consist of some 39 plays,
                    154 sonnets, three long narrative poems, and a few other verses, some of uncertain authorship. His plays have been translated into every major living language and are performed more often than those of any other playwright. He remains arguably the most influential writer in the English language, and his works continue to be studied and reinterpreted.\nShakespeare was born and raised in Stratford-upon-Avon, Warwickshire. At the age of 18, he married Anne Hathaway, with whom he had three children: Susanna, and twins Hamnet and Judith. Sometime between 1585 and 1592, he began a successful career in London as an actor, writer, and part-owner of a playing company called the Lord Chamberlain\'s Men, later known as the King\'s Men. At age 49 (around 1613), he appears to have retired to Stratford, where he died three years later. Few records of Shakespeare\'s private life survive; this has stimulated considerable speculation about such matters as his physical appearance, his sexuality, his religious beliefs and whether the works attributed to him were written by others.Shakespeare produced most of his known works between 1589 and 1613. His early plays were primarily comedies and histories and are regarded as some of the best works produced in these genres. He then wrote mainly tragedies until 1608, among them Hamlet, Romeo and Juliet, Othello, King Lear, and Macbeth, all considered to be among the finest works in the English language. In the last phase of his life, he wrote tragicomedies (also known as romances) and collaborated with other playwrights.\nMany of Shakespeare\'s plays were published in editions of varying quality and accuracy in his lifetime. However, in 1623, John Heminges and Henry Condell, two fellow actors and friends of Shakespeare\'s, published a more definitive text known as the First Folio, a posthumous collected edition of Shakespeare\'s dramatic works that included all but two of his plays. Its Preface was a prescient poem by Ben Jonson, a former rival of Shakespeare, that hailed Shakespeare with the now famous epithet: "not of an age, but for all time".'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'61999': {'pageid': 61999, 'ns': 0, 'title': 'Danielle Steel', 'extract': 'Danielle Fernandes Dominique Schuelein-Steel (born August 14,
                    1947) is an American writer, best known for her romance novels. She is the bestselling living author and the fourth-bestselling fiction author of all time, with over 800 million copies sold. As of 2021, she has written 190 books, including over 140 novels.\nBased in California for most of her career, Steel has produced several books a year, often juggling up to five projects at once. All of her novels have been bestsellers, including those issued in hardback, despite "a resounding lack of critical acclaim" (Publishers Weekly). Her books often involve rich families facing a crisis, threatened by dark elements such as prison, fraud, blackmail and suicide. Steel has also published children\'s fiction and poetry, as well as creating a foundation that funds mental illness related organizations. Her books have been translated into 43 languages, with 22 adapted for television, including two that have received Golden Globe nominations.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'62075': {'pageid': 62075, 'ns': 0, 'title': 'Harold Robbins', 'extract': 'Harold Robbins (May 21,
                    1916 – October 14,
                    1997) was an American author of popular novels. One of the best-selling writers of all time, he wrote over 25 best-sellers, selling over 750 million copies in 32 languages.\n\n'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'199995': {'pageid': 199995, 'ns': 0, 'title': 'Barbara Cartland', 'extract': 'Dame Mary Barbara Hamilton Cartland,  (9 July 1901 – 21 May 2000) was an English writer, known as the Queen of Romance, who published both contemporary and historical romance novels, the latter set primarily during the Victorian or Edwardian period. Cartland is one of the best-selling authors worldwide of the 20th century.  \nMany of her novels have been adapted to films for television including A Hazard of Hearts, A Ghost in Monte Carlo and Duel of Hearts.Her novels have been translated from English into numerous languages, making Cartland the fifth most translated author worldwide (note: not including biblical works). Her prolific output totals some 723 novels and she is credited in the Guinness World Records for the most novels published in a single year (1977).Although best known for her romantic novels, she also wrote non-fiction titles including biographies, plays, music, verse, drama, operettas, and several health and cook books. She also contributed advice to TV audiences and newspaper magazine articles.She sold more than 750 million copies of her books, though other sources estimate her total sales at more than two billion. The covers of her novels featured portrait-style artwork, usually designed by Francis Marshall (1901–1980).Cartland was also a businesswoman who was head of Cartland Promotions. She was a London society figure, often dressed in a pink chiffon gown, a plumed hat, blonde wig, and heavy make-up.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'182032': {'pageid': 182032, 'ns': 0, 'title': 'Georges Simenon', 'extract': "Georges Joseph Christian Simenon (French: [ʒɔʁʒ simnɔ̃]; 12/13 February 1903 – 4 September 1989) was a Belgian writer, most famous for his fictional detective Jules Maigret. One of the most popular authors of the 20th century, he published around 400 novels, 21 volumes of memoirs and many short stories, selling over 500 million copies.\nApart from his detective fiction, he achieved critical acclaim for his literary novels which he called romans durs (hard novels). Among his literary admirers were Max Jacob, François Mauriac and André Gide. Gide wrote, “I consider Simenon a great novelist, perhaps the greatest, and the most genuine novelist that we have had in contemporary French literature.”Born and raised in Liège, Belgium, Simenon lived for extended periods in France (1922–45), the United States (1946–55) and finally Switzerland (1957-1989). Much of his work is semi-autobiographical, inspired by his childhood and youth in Liège, extensive travels in Europe and the world, wartime experiences, troubled marriages, and numerous love affairs.\nCritics such as John Banville have praised Simenon's novels for their psychological insights and vivid evocation of time and place. Among his most notable works are The Saint-Fiacre Affair (1932), Monsieur Hire's Engagement (1933), Act of Passion (1947), The Snow was Dirty (1948) and The Cat (1967)."
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'16027': {'pageid': 16027, 'ns': 0, 'title': 'J. K. Rowling', 'extract': 'Joanne Rowling  ( "rolling"; born 31 July 1965), also known by her pen name J. K. Rowling, is a British author and philanthropist. She wrote Harry Potter, a seven-volume children\'s fantasy series published from 1997 to 2007. The series has sold over 600 million copies, been translated into 84 languages, and spawned a global media franchise including films and video games. The Casual Vacancy (2012) was her first novel for adults. She writes Cormoran Strike, an ongoing crime fiction series, under the alias Robert Galbraith.\nBorn in Yate, Gloucestershire, Rowling was working as a researcher and bilingual secretary for Amnesty International in 1990 when she conceived the idea for the Harry Potter series while on a delayed train from Manchester to London. The seven-year period that followed saw the death of her mother, the birth of her first child, divorce from her first husband, and relative poverty until the first novel in the series, Harry Potter and the Philosopher\'s Stone, was published in 1997. Six sequels followed, and by 2008, Forbes had named her the world\'s highest-paid author. \nRowling concluded the Harry Potter series with Harry Potter and the Deathly Hallows (2007). The novels follow a boy called Harry Potter as he attends Hogwarts, a school for wizards, and battles Lord Voldemort. Death and the divide between good and evil are the central themes of the series. Its influences include Bildungsroman (the coming-of-age genre), school stories, fairy tales, and Christian allegory. The series revived fantasy as a genre in the children\'s market, spawned a host of imitators, and inspired an active fandom. Critical reception has been more mixed. Many reviewers see Rowling\'s writing as conventional; some regard her portrayal of gender and social division as regressive. There were also religious debates over Harry Potter.\nRowling has won many accolades for her work. She has received an OBE and made a Companion of Honour for services to literature and philanthropy. Harry Potter brought her wealth and recognition, which she has used to advance philanthropic endeavours and political causes. She co-founded the charity Lumos and established the Volant Charitable Trust, named after her mother. Rowling\'s charitable giving centres on medical causes and supporting at-risk women and children. In politics, she has donated to Britain\'s Labour Party and opposed Scottish independence and Brexit. Since late 2019, she has publicly expressed her opinions on transgender people and related civil rights. These have been criticised as transphobic by LGBT rights organisations and some feminists, but have received support from other feminists and individuals.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'10258': {'pageid': 10258, 'ns': 0, 'title': 'Enid Blyton', 'extract': "Enid Mary Blyton (11 August 1897 – 28 November 1968) was an English children's writer, whose books have been worldwide bestsellers since the 1930s, selling more than 600 million copies. Her books are still enormously popular and have been translated into ninety languages. As of June 2019, Blyton held 4th place for the most translated author. She wrote on a wide range of topics, including education, natural history, fantasy, mystery, and biblical narratives. She is best remembered today for her Noddy, Famous Five, Secret Seven, the Five Find-Outers, and Malory Towers books, although she also wrote many others including the St Clare's, The Naughtiest Girl and The Faraway Tree series.\nHer first book, Child Whispers, a 24-page collection of poems, was published in 1922. Following the commercial success of her early novels, such as Adventures of the Wishing-Chair (1937) and The Enchanted Wood (1939), Blyton went on to build a literary empire, sometimes producing fifty books a year, in addition to her prolific magazine and newspaper contributions. Her writing was unplanned and sprang largely from her unconscious mind: she typed her stories as events unfolded before her. The sheer volume of her work and the speed with which she produced it led to rumours that Blyton employed an army of ghost writers, a charge she vigorously denied.\nBlyton's work became increasingly controversial among literary critics, teachers, and parents beginning in the 1950s, due to the alleged unchallenging nature of her writing and her themes, particularly in the Noddy series. Some libraries and schools banned her works, and from the 1930s until the 1950s the BBC refused to broadcast her stories because of their perceived lack of literary merit. Her books have been criticised as elitist, sexist, racist, xenophobic, and at odds with the more progressive environment that was emerging in post-World War II Britain, but they have continued to be bestsellers since her death in 1968.\nShe felt she had a responsibility to provide her readers with a strong moral framework, so she encouraged them to support worthy causes. In particular, through the clubs she set up or supported, she encouraged and organised them to raise funds for animal and paediatric charities.\nThe story of Blyton's life was dramatised in Enid, a BBC television film featuring Helena Bonham Carter in the title role. It was first broadcast in the UK on BBC Four in 2009."
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'345575': {'pageid': 345575, 'ns': 0, 'title': 'Sidney Sheldon', 'extract': "Sidney Sheldon (February 11, 1917 – January 30, 2007) was an American writer. He was prominent in the 1930s, first working on Broadway plays, and then in motion pictures, notably writing the successful comedy The Bachelor and the Bobby-Soxer (1947), which earned him an Oscar in 1948. He went on to work in television, where over 20-years he created The Patty Duke Show (1963–66), I Dream of Jeannie (1965–70), and Hart to Hart (1979–84). After turning 50, he began writing best-selling romantic suspense novels, such as Master of the Game (1982), The Other Side of Midnight (1973), and Rage of Angels (1980). \nSheldon's 18 novels have sold over 300 million copies in 51 languages. Sheldon is consistently cited as one of the top-10 best-selling fiction writers of all time."
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'360756': {'pageid': 360756, 'ns': 0, 'title': 'Eiichiro Oda', 'extract': "Eiichiro Oda (Japanese: 尾田 栄一郎, Hepburn: Oda Eiichirō, born January 1, 1975) is a Japanese manga artist and the creator of the series One Piece (1997–present). With more than 516.6 million tankōbon copies in circulation worldwide, One Piece is both the best-selling manga in history and the best-selling comic series printed in volume, in turn making Oda one of the best-selling fiction authors. The series' popularity resulted in Oda being named one of the manga artists that changed the history of manga."
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'3801592': {'pageid': 3801592, 'ns': 0, 'title': 'Gilbert Patten', 'extract': 'William George "Gilbert" Patten (October 25,
                    1866 – January 16,
                    1945) was a writer of dime novels and is best known as author of the Frank Merriwell stories, with the pen name Burt L. Standish.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'8855': {'pageid': 8855, 'ns': 0, 'title': 'Dr. Seuss', 'extract': 'Theodor Seuss Geisel ( (listen); March 2,
                    1904 – September 24,
                    1991) was an American children\'s author and cartoonist. He is known for his work writing and illustrating more than 60 books under the pen name Dr. Seuss (). His work includes many of the most popular children\'s books of all time, selling over 600 million copies and being translated into more than 20 languages by the time of his death.Geisel adopted the name "Dr. Seuss" as an undergraduate at Dartmouth College and as a graduate student at Lincoln College, Oxford. He left Oxford in 1927 to begin his career as an illustrator and cartoonist for Vanity Fair, Life and various other publications. He also worked as an illustrator for advertising campaigns, most notably for FLIT and Standard Oil, and as a political cartoonist for the New York newspaper PM. He published his first children\'s book And to Think That I Saw It on Mulberry Street in 1937. During World War II, he took a brief hiatus from children\'s literature to illustrate political cartoons, and he also worked in the animation and film department of the United States Army where he wrote, produced or animated many productions including Design for Death, which later won the 1947 Academy Award for Best Documentary Feature Film.After the war, Geisel returned to writing children\'s books, writing classics like If I Ran the Zoo (1950), Horton Hears a Who! (1955), The Cat in the Hat (1957), How the Grinch Stole Christmas! (1957), Green Eggs and Ham (1960), One Fish, Two Fish, Red Fish, Blue Fish (1960), The Sneetches and Other Stories (1961), The Lorax (1971), The Butter Battle Book (1984), and Oh, the Places You\'ll Go! (1990). He published over 60 books during his career, which have spawned numerous adaptations, including 11 television specials, five feature films, a Broadway musical, and four television series.\nGeisel won the Lewis Carroll Shelf Award in 1958 for Horton Hatches the Egg and again in 1961 for And to Think That I Saw It on Mulberry Street. He received the Regina Medal award from the Catholic Library Association in 1982. Geisel\'s birthday, March 2, has been adopted as the annual date for National Read Across America Day, an initiative on reading created by the National Education Association. He also received two Primetime Emmy Awards for Outstanding Children\'s Special for Halloween Is Grinch Night (1978) and Outstanding Animated Program for The Grinch Grinches the Cat in the Hat (1982).\n\n'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'3092': {'pageid': 3092, 'ns': 0, 'title': 'Akira Toriyama', 'extract': "Akira Toriyama (Japanese: 鳥山 明, Hepburn: Toriyama Akira, born April 5, 1955) is a Japanese manga artist and character designer. He first achieved mainstream recognition for his highly successful manga series Dr. Slump, before going on to create Dragon Ball (his best-known work) and acting as a character designer for several popular video games such as the Dragon Quest series, Chrono Trigger, and Blue Dragon. Toriyama is regarded as one of the authors who changed the history of manga, as his works are highly influential and popular, particularly Dragon Ball, which many manga artists cite as a source of inspiration.\nHe earned the 1981 Shogakukan Manga Award for best shōnen or shōjo manga with Dr. Slump, and it went on to sell over 35 million copies in Japan. It was adapted into a successful anime series, with a second anime created in 1997, 13 years after the manga ended. His next series, Dragon Ball, would become one of the most popular and successful manga in the world. Having sold 300 million copies worldwide, it is one of the best-selling manga series of all time and is considered to be one of the main reasons for the period when manga circulation was at its highest in the mid-1980s and mid-1990s. Overseas, Dragon Ball's anime adaptations have been more successful than the manga and are credited with boosting anime's popularity in the Western world. In 2019, Toriyama was decorated a Chevalier of the French Ordre des Arts et des Lettres for his contributions to the arts."
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'18622119': {'pageid': 18622119, 'ns': 0, 'title': 'Leo Tolstoy', 'extract': 'Count Lev Nikolayevich Tolstoy (; Russian: Лев Николаевич Толстой, IPA: [ˈlʲef nʲɪkɐˈla(j)ɪvʲɪtɕ tɐlˈstoj
                    ] (listen); 9 September [O.S. 28 August
                    ] 1828 –  20 November [O.S. 7 November
                    ] 1910), usually referred to in English as Leo Tolstoy, was a Russian writer who is regarded as one of the greatest authors of all time. He received nominations for the Nobel Prize in Literature every year from 1902 to 1906 and for the Nobel Peace Prize in 1901,
                    1902, and 1909; the fact that he never won is a major controversy.Born to an aristocratic Russian family in 1828, Tolstoy\'s notable works include the novels War and Peace (1869) and Anna Karenina (1878), often cited as pinnacles of realist fiction. He first achieved literary acclaim in his twenties with his semi-autobiographical trilogy, Childhood, Boyhood, and Youth (1852–1856), and Sevastopol Sketches (1855), based upon his experiences in the Crimean War. His fiction includes dozens of short stories such as "After the Ball" (1911), and several novellas such as The Death of Ivan Ilyich (1886), Family Happiness (1859) and Hadji Murad (1912). He also wrote plays and philosophical essays.\nIn the 1870s, Tolstoy experienced a profound moral crisis, followed by what he regarded as an equally profound spiritual awakening, as outlined in his non-fiction work A Confession (1882). His literal interpretation of the ethical teachings of Jesus, centering on the Sermon on the Mount, caused him to become a fervent Christian anarchist and pacifist. His ideas on nonviolent resistance, expressed in such works as The Kingdom of God Is Within You (1894), had a profound impact on such pivotal 20th-century figures as Mahatma Gandhi and Martin Luther King Jr. He also became a dedicated advocate of Georgism, the economic philosophy of Henry George, which he incorporated into his writing, particularly Resurrection (1899).'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'6092878': {'pageid': 6092878, 'ns': 0, 'title': 'Corín Tellado', 'extract': "María del Socorro Tellado López (25 April 1927 in El Franco, Asturias, Spain – 11 April 2009), known as Corín Tellado, was a prolific Spanish writer of romantic novels and photonovels that were best-sellers in several Spanish-language countries. She published more than 4,000 titles and sold more than 400 million books which have been translated into several languages. She was listed in the 1994 Guinness World Records as having sold the most books written in Spanish, and earlier in 1962 UNESCO declared her the most read Spanish writer after Miguel de Cervantes.\nHer novels were different from other contemporary Western European romantic writers' works because she usually set them in the present and didn't use eroticism, due to the Spanish regime's strict censorship. Her style was direct and her characters were simply presented. These novels have inspired several telenovelas."
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'8910': {'pageid': 8910, 'ns': 0, 'title': 'Dean Koontz', 'extract': 'Dean Ray Koontz (born July 9,
                    1945) is an American author. His novels are billed as suspense thrillers, but frequently incorporate elements of horror, fantasy, science fiction, mystery, and satire. Many of his books have appeared on The New York Times Best Seller list, with fourteen hardcovers and sixteen paperbacks reaching the number-one position. Koontz wrote under a number of pen names earlier in his career, including "David Axton",
                    "Deanna Dwyer",
                    "K.R. Dwyer",
                    "Leigh Nichols" and "Brian Coffey". He has published over 105 novels and a number of novellas and collections of short stories, and has sold over 450 million copies of his work.\n\n'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'595864': {'pageid': 595864, 'ns': 0, 'title': 'Jackie Collins', 'extract': 'Jacqueline Jill Collins  (4 October 1937 – 19 September 2015) was an English romance novelist and actress. She moved to Los Angeles in 1985 and spent most of her career there. She wrote 32 novels, all of which appeared on The New York Times bestsellers list. Her books have sold more than 500 million copies and have been translated into 40 languages. Eight of her novels have been adapted for the screen, either as films or television miniseries. She was the younger sister of Dame Joan Collins.\n\n'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'63205': {'pageid': 63205, 'ns': 0, 'title': 'Horatio Alger', 'extract': 'Horatio Alger Jr. (; January 13,
                    1832 – July 18,
                    1899) was an American author who wrote young adult novels about impoverished boys and their rise from humble backgrounds to lives of middle-class security and comfort through good works. His writings were characterized by the "rags-to-riches" narrative, which had a formative effect on the United States during the Gilded Age.\nAlger secured his literary niche in 1868 with the publication of his fourth book, Ragged Dick, the story of a poor bootblack\'s rise to middle-class respectability. This novel was a huge success. His many books that followed were essentially variations on Ragged Dick and featured stock characters: the valiant, hard-working, honest youth; the noble mysterious stranger; the snobbish youth; and the evil, greedy squire. In the 1870s, Alger\'s fiction was growing stale. His publisher suggested he tour the Western United States for fresh material to incorporate into his fiction. Alger took a trip to California, but the trip had little effect on his writing: he remained mired in the staid theme of "poor boy makes good." The backdrops of these novels, however, became the Western United States, rather than the urban environments of the Northeastern United States.\nIn the last decades of the 19th century, Alger\'s moral tone coarsened with the change in boys\' tastes. The public wanted sensational thrills. The Protestant work ethic was less prevalent in the United States, and violence, murder, and other sensational themes entered Alger\'s works. Public librarians questioned whether his books should be made available to the young. They were briefly successful, but interest in Alger\'s novels was renewed in the first decades of the 20th century, and they sold in the thousands. By the time he died in 1899, Alger had published around a hundred volumes. He is buried in Natick, Massachusetts. Since 1947, the Horatio Alger Association of Distinguished Americans has awarded scholarships and prizes to deserving individuals.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'1138392': {'pageid': 1138392, 'ns': 0, 'title': 'Nora Roberts', 'extract': 'Nora Roberts (born Eleanor Marie Robertson on October 10,
                    1950) is an American author of more than 225 romance novels. She writes as J. D. Robb for the in Death series and has also written under the pseudonyms Jill March and for publications in the U.K. as Sarah Hardesty.\nRoberts was the first author to be inducted into the Romance Writers of America Hall of Fame. As of 2011, her novels had spent a combined 861 weeks on The New York Times Best Seller list, including 176 weeks in the number-one spot.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'368058': {'pageid': 368058, 'ns': 0, 'title': 'R. L. Stine', 'extract': 'Robert Lawrence Stine (; born October 8,
                    1943), sometimes known as Jovial Bob Stine and Eric Affabee, is an American novelist, short story writer, television producer, screenwriter, and executive editor.\nStine has been referred to as the "Stephen King of children\'s literature" and is the author of hundreds of horror fiction novels, including the books in the Fear Street, Goosebumps, Rotten School, Mostly Ghostly and The Nightmare Room series. Some of his other works include a Space Cadets trilogy, two Hark gamebooks, and dozens of joke books. As of 2008, Stine\'s books have sold over 400 million copies.\n\n'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'52790': {'pageid': 52790, 'ns': 0, 'title': 'Alexander Pushkin', 'extract': 'Alexander Sergeyevich Pushkin (English: ; Russian: Александр Сергеевич Пушкин, tr. Aleksandr Sergeyevich Pushkin, IPA: [ɐlʲɪkˈsandr sʲɪrˈɡʲe(j)ɪvʲɪtɕ ˈpuʂkʲɪn
                    ] (listen); 6 June [O.S. 26 May
                    ] 1799 – 10 February [O.S. 29 January
                    ] 1837) was a Russian poet, playwright, and novelist of the Romantic era. He is considered by many to be the greatest Russian poet and the founder of modern Russian literature.Pushkin was born into the Russian nobility in Moscow. His father, Sergey Lvovich Pushkin, belonged to an old noble family. His maternal great-grandfather was Major-General Abram Petrovich Gannibal, a nobleman of African origin who was kidnapped from his homeland and raised in the Emperor\'s court household as his godson. \nHe published his first poem at the age of 15, and was widely recognized by the literary establishment by the time of his graduation from the Tsarskoye Selo Lyceum. Upon graduation from the Lycée, Pushkin recited his controversial poem "Ode to Liberty", one of several that led to his exile by Emperor Alexander I. While under the strict surveillance of the Emperor\'s political police and unable to publish, Pushkin wrote his most famous play, Boris Godunov. His novel in verse, Eugene Onegin, was serialized between 1825 and 1832. Pushkin was fatally wounded in a duel with his wife\'s alleged lover and her sister\'s husband, Georges-Charles de Heeckeren d\'Anthès, also known as Dantes-Gekkern, a French officer serving with the Chevalier Guard Regiment.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'26954': {'pageid': 26954, 'ns': 0, 'title': 'Stephen King', 'extract': 'Stephen Edwin King (born September 21,
                    1947) is an American author of horror, supernatural fiction, suspense, crime, science-fiction, and fantasy novels. Described as the "King of Horror," a play on his surname and a reference to his high standing in pop culture, his books have sold more than 350 million copies, and many have been adapted into films, television series, miniseries, and comic books. King has published 64 novels, including seven under the pen name Richard Bachman, and five non-fiction books. He has also written approximately 200 short stories, most of which have been published in book collections.King has received Bram Stoker Awards, World Fantasy Awards, and British Fantasy Society Awards. In 2003, the National Book Foundation awarded him the Medal for Distinguished Contribution to American Letters. He has also received awards for his contribution to literature for his entire bibliography, such as the 2004 World Fantasy Award for Life Achievement and the 2007 Grand Master Award from the Mystery Writers of America. In 2015, he was awarded with a National Medal of Arts from the U.S. National Endowment for the Arts for his contributions to literature.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'65145': {'pageid': 65145, 'ns': 0, 'title': 'Paulo Coelho', 'extract': 'Paulo Coelho de Souza (, Portuguese: [ˈpawlu kuˈeʎu
                    ]; born 24 August 1947) is a Brazilian lyricist and novelist and a member of the Brazilian Academy of Letters since 2002. His novel The Alchemist became an international best-seller and he has published 28 more books since then.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'994914': {'pageid': 994914, 'ns': 0, 'title': 'Jirō Akagawa', 'extract': 'Jirō Akagawa (赤川 次郎, Akagawa Jirō, born February 29,
                    1948) is a Japanese novelist born in Fukuoka, Fukuoka Prefecture, Japan.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'16336': {'pageid': 16336, 'ns': 0, 'title': 'Jeffrey Archer', 'extract': 'Jeffrey Howard Archer, Baron Archer of Weston-super-Mare (born 15 April 1940) is an English novelist, life peer and former politician. Before becoming an author, Archer was a Member of Parliament (1969–1974), but did not seek re-election after a financial scandal that left him almost bankrupt.Archer revived his fortunes as a novelist. His 1979 novel Kane and Abel remains one of the best-selling books in the world, with an estimated 34 million copies sold worldwide. Overall his books have sold more than 320 million copies worldwide.Archer became deputy chairman of the Conservative Party (1985–86), before resigning after a newspaper accused him of paying money to a prostitute. In 1987, he won a court case and was awarded large damages because of this claim. He was made a life peer in 1992 and subsequently became Conservative candidate to be the first elected Mayor of London. He resigned his candidacy in 1999 after it emerged that he had lied in his 1987 libel case. He was imprisoned (2001–2003) for perjury and perverting the course of justice, ending his active political career.\n\n'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'311198': {'pageid': 311198, 'ns': 0, 'title': "Louis L'Amour", 'extract': 'Louis Dearborn L\'Amour (; né LaMoore; March 22,
                    1908 – June 10,
                    1988) was an American novelist and short story writer. His books consisted primarily of Western novels (though he called his work "frontier stories"); however, he also wrote historical fiction (The Walking Drum), science fiction (The Haunted Mesa), non-fiction (Frontier), as well as poetry and short-story collections. Many of his stories were made into films. His books remain popular and most have gone through multiple printings. At the time of his death almost all of his 105 existing works (89 novels,
                    14 short-story collections, and two full-length works of nonfiction) were still in print, and he was "one of the world\'s most popular writers".'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'43921': {'pageid': 43921, 'ns': 0, 'title': 'René Goscinny', 'extract': "René Goscinny (French: [ʁəne ɡɔsini], Polish: [ɡɔɕˈt͡ɕinnɨ] (listen); 14 August 1926 – 5 November 1977) was a French comic editor and writer, who created the Astérix comic book series with illustrator Albert Uderzo. He was raised primarily in Buenos Aires, Argentina, where he attended French schools, as well as lived in the United States for a short period of time. There he met Belgian cartoonist Morris. After his return to France, they collaborated for more than 20 years on the comic series Lucky Luke (in what was considered the series' golden age).He wrote Iznogoud with Jean Tabary. Goscinny also wrote a series of children's books known as Le Petit Nicolas (Little Nicolas) illustrated by Jean-Jacques Sempé."
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'144874': {'pageid': 144874, 'ns': 0, 'title': 'Erle Stanley Gardner', 'extract': "Erle Stanley Gardner (July 17, 1889 – March 11, 1970) was an American lawyer and author. He is best known for the Perry Mason series of detective stories, but he wrote numerous other novels and shorter pieces and also a series of nonfiction books, mostly narrations of his travels through Baja California and other regions in Mexico.\nThe best-selling American author of the 20th century at the time of his death, Gardner also published under numerous pseudonyms, including A.A. Fair, Carl Franklin Ruth, Carleton Kendrake, Charles M. Green, Charles J. Kenny, Edward Leaming, Grant Holiday, Kyle Corning, Les Tillray,  Robert Parr, Stephen Caldwell and not to forget Gardner's very special pen name Della Street (The Case of the Suspect Sweethearts). Three stories were published as Anonymous. (A Fair Trial, Part Music and Part Tears, You Can't Run Away from Yourself aka The Jazz Baby)"
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'460443': {'pageid': 460443, 'ns': 0, 'title': 'Edgar Wallace', 'extract': 'Richard Horatio Edgar Wallace (1 April 1875 – 10 February 1932) was a British writer.\nBorn into poverty as an illegitimate London child, Wallace left school at the age of 12. He joined the army at age 21 and was a war correspondent during the Second Boer War for Reuters and the Daily Mail. Struggling with debt, he left South Africa, returned to London and began writing thrillers to raise income, publishing books including The Four Just Men (1905). Drawing on his time as a reporter in the Congo, covering the Belgian atrocities, Wallace serialised short stories in magazines such as The Windsor Magazine and later published collections such as  Sanders of the River (1911). He signed with Hodder and Stoughton in 1921 and became an internationally recognised author.\nAfter an unsuccessful bid to stand as Liberal MP for Blackpool (as one of David Lloyd George\'s Independent Liberals) in the 1931 general election, Wallace moved to Hollywood, where he worked as a script writer for RKO. He died suddenly from undiagnosed diabetes, during the initial drafting of King Kong (1933).\nWallace was such a prolific writer that one of his publishers claimed that a quarter of all books in England were written by him. As well as journalism, Wallace wrote screen plays, poetry, historical non-fiction,
                    18 stage plays,
                    957 short stories and over 170 novels,
                    12 in 1929 alone. More than 160 films have been made of Wallace\'s work.In addition to his work on King Kong, he is remembered as a writer of "the colonial imagination", for the J. G. Reeder detective stories, and for The Green Archer serial. He sold over 50 million copies of his combined works in various editions and The Economist in 1997 describes him as "one of the most prolific thriller writers of [the 20th] century", although the great majority of his books are out of print in the UK, but are still read in Germany. A 50-minute German TV documentary was made in 1963 called The Edgar Wallace Story, which featured his son Bryan Edgar Wallace.\n\n'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'8502748': {'pageid': 8502748, 'ns': 0, 'title': 'Janet Dailey', 'extract': 'Janet Anne Haradon Dailey (May 21,
                    1944 – December 14,
                    2013) was an American author of numerous romance novels as Janet Dailey (her married name). Her novels have been translated into nineteen languages and have sold more than 300 million copies worldwide. Dailey was both an author and entrepreneur.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'349150': {'pageid': 349150, 'ns': 0, 'title': 'Jin Yong', 'extract': 'Louis Cha Leung-yung  (Chinese: 查良鏞; 6 February 1924 – 30 October 2018), better known by his pen name Jin Yong (Chinese: 金庸), pronounced "Gum Yoong" in Cantonese, was a Chinese wuxia ("martial arts and chivalry") novelist and essayist who co-founded the Hong Kong daily newspaper Ming Pao in 1959 and served as its first editor-in-chief. He was Hong Kong\'s most famous writer, and is named along with Gu Long and Liang Yusheng as the "Three Legs of the Tripod of Wuxia".\nHis wuxia novels have a widespread following in Chinese communities worldwide. His 15 works written between 1955 and 1972 earned him a reputation as one of the greatest and most popular wuxia writers ever. By the time of his death he was the best-selling Chinese author, and over 100 million copies of his works have been sold worldwide (not including an unknown number of pirated copies). According to The Oxford Guide to Contemporary World Literature, Jin Yong\'s novels are considered to be of very high quality and are able to appeal to both highbrow and lowbrow tastes. His works have the unusual ability to transcend geographical and ideological barriers separating Chinese communities of the world, achieving a greater success than any other contemporary Hong Kong writer.His works have been translated into many languages including English, French, Catalan, Spanish, Korean, Japanese, Cambodian, Vietnamese, Thai, Burmese, Malay and Indonesian. He has many fans outside of Chinese-speaking areas, as a result of the numerous adaptations of his works into films, television series, comics and video games.\nThe asteroid 10930 Jinyong (1998 CR2) is named after him.\n\n'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'54078': {'pageid': 54078, 'ns': 0, 'title': 'Robert Ludlum', 'extract': 'Robert Ludlum (May 25,
                    1927 – March 12,
                    2001) was an American author of 27 thriller novels, best known as the creator of Jason Bourne from the original The Bourne Trilogy series. The number of copies of his books in print is estimated between 300 million and 500 million. They have been published in 33 languages and 40 countries. Ludlum also published books under the pseudonyms Jonathan Ryder and Michael Shepherd.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'321560': {'pageid': 321560, 'ns': 0, 'title': 'Osamu Tezuka', 'extract': 'Osamu Tezuka (手塚 治虫, born 手塚 治, Tezuka Osamu; (1928-11-03)3 November 1928 – 9 February 1989) was a Japanese manga artist, cartoonist, and animator. Born in Osaka Prefecture, his prolific output, pioneering techniques, and innovative redefinitions of genres earned him such titles as "the Father of Manga" (マンガの父, Manga no Chichi),
                    "the Godfather of Manga" (マンガの教父, Manga no Kyōfu) and "the God of Manga" (マンガの神様, Manga no Kami-sama). Additionally, he is often considered the Japanese equivalent to Walt Disney, who served as a major inspiration during Tezuka\'s formative years. Though this phrase praises the quality of his early manga works for children and animations, it also blurs the significant influence of his later, more literary, gekiga works.\nTezuka began what was known as the manga revolution in Japan with his New Treasure Island published in 1947. His output would spawn some of the most influential, successful, and well-received manga series including the children mangas Astro Boy, Princess Knight and Kimba the White Lion, and the adult-oriented series Black Jack, Phoenix, and Buddha, all of which won several awards.\nTezuka died of stomach cancer in 1989. His death had an immediate impact on the Japanese public and other cartoonists. A museum was constructed in Takarazuka dedicated to his memory and life works, and Tezuka received many posthumous awards. Several animations were in production at the time of his death along with the final chapters of Phoenix, which were never released.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'1022756': {'pageid': 1022756, 'ns': 0, 'title': 'James Patterson', 'extract': 'James Brendan Patterson (born March 22,
                    1947) is an American author. Among his works are the Alex Cross, Michael Bennett, Women\'s Murder Club, Maximum Ride, Daniel X, NYPD Red, Witch & Wizard, Private and Middle School series, as well as many stand-alone thrillers, non-fiction, and romance novels. His books have sold more than 425 million copies, and he was the first person to sell 1 million e-books. In 2016, Patterson topped Forbes\'s list of highest-paid authors for the third consecutive year, with an income of $95 million. His total income over a decade is estimated at $700 million.In November 2015, Patterson received the Literarian Award from the National Book Foundation, which cited him as a "passionate campaigner to make books and reading a national priority." Patterson has donated millions of dollars in grants and scholarship to various universities, teachers\' colleges, independent bookstores, school libraries, and college students to promote literacy.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'5863486': {'pageid': 5863486, 'ns': 0, 'title': 'Frédéric Dard', 'extract': 'Frédéric Dard (Frédéric Charles Antoine Dard; 29 June 1921, in Bourgoin-Jallieu, Isère, France – 6 June 2000, in Bonnefontaine, Fribourg, Switzerland) was a French crime writer. He wrote more than three hundred novels, plays and screenplays, under his own name and a variety of pseudonyms, including the San-Antonio book series.\n\n'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'1531408': {'pageid': 1531408, 'ns': 0, 'title': 'Stan and Jan Berenstain', 'extract': "Stanley Melvin Berenstain (September 29, 1923 – November 26, 2005) and Janice Marian Berenstain (née Grant; July 26, 1923 – February 24, 2012) were American writers and illustrators best known for creating the children's book series The Berenstain Bears.\nBoth Stan and Jan were born and raised in Philadelphia, Pennsylvania. Jan attended Radnor High School in Radnor, Pennsylvania.  Stan was Jewish and Jan was an Episcopalian. They were married for 59 years until Stan's death in 2005."
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'55490': {'pageid': 55490, 'ns': 0, 'title': 'Roald Dahl', 'extract': 'Roald Dahl (13 September 1916 – 23 November 1990) was a British popular author of irreverent children\'s literature and short stories, a poet, and wartime fighter ace. His books have sold more than 300 million copies worldwide. Dahl has been called "one of the greatest storytellers for children of the 20th century".Dahl was born in Wales to affluent Norwegian immigrant parents, and spent most of his life in England. He served in the Royal Air Force (RAF) during the Second World War. He became a fighter pilot and, subsequently, an intelligence officer, rising to the rank of acting wing commander. He rose to prominence as a writer in the 1940s with works for children and for adults, and he became one of the world\'s best-selling authors. His awards for contribution to literature include the 1983 World Fantasy Award for Life Achievement and the British Book Awards\' Children\'s Author of the Year in 1990. In 2008, The Times placed Dahl 16th on its list of "The 50 Greatest British Writers Since 1945". In 2021, Forbes ranked him the top-earning dead celebrity.Dahl\'s short stories are known for their unexpected endings, and his children\'s books for their unsentimental, macabre, often darkly comic mood, featuring villainous adult enemies of the child characters. His children\'s books champion the kindhearted and feature an underlying warm sentiment. His works for children include James and the Giant Peach, Charlie and the Chocolate Factory, Matilda, The Witches, Fantastic Mr Fox, The BFG, The Twits, George\'s Marvellous Medicine and Danny, the Champion of the World. His works for older audiences include the short story collections Tales of the Unexpected and The Wonderful Story of Henry Sugar and Six More.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'61998': {'pageid': 61998, 'ns': 0, 'title': 'John Grisham', 'extract': "John Ray Grisham Jr. (; born February 8, 1955, in Jonesboro, Arkansas) is an American novelist, lawyer and former member of the 7th district of the Mississippi House of Representatives, known for his popular legal thrillers. According to the American Academy of Achievement, Grisham has written 28 consecutive number-one fiction bestsellers, and his books have sold 300 million copies worldwide. Along with Tom Clancy and J. K. Rowling, Grisham is one of only three authors to have sold two million copies on a first printing.Grisham graduated from Mississippi State University and earned a Juris Doctor from the University of Mississippi School of Law in 1981. He practised criminal law for about a decade and served in the Mississippi House of Representatives from 1983 to 1990.Grisham's first novel, A Time to Kill, was published in June 1989, four years after he began writing it. Grisham's first bestseller, The Firm, sold more than seven million copies. The book was adapted into a 1993 feature film of the same name, starring Tom Cruise, and a 2012 TV series which continues the story ten years after the events of the film and novel. Seven of his other novels have also been adapted into films: The Chamber, The Client, A Painted House, The Pelican Brief, The Rainmaker, The Runaway Jury, and Skipping Christmas."
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'205593': {'pageid': 205593, 'ns': 0, 'title': 'Zane Grey', 'extract': "Pearl Zane Grey (January 31, 1872 – October 23, 1939) was an American author and dentist. He is known for his popular adventure novels and stories associated with the Western genre in literature and the arts; he idealized the American frontier. Riders of the Purple Sage (1912) was his best-selling book.\nIn addition to the success of his printed works, his books have second lives and continuing influence adapted for films and television. His novels and short stories were adapted into 112 films, two television episodes, and a television series, Dick Powell's Zane Grey Theatre.\n\n"
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'623498': {'pageid': 623498, 'ns': 0, 'title': 'Irving Wallace', 'extract': 'Irving Wallace (March 19,
                    1916 – June 29,
                    1990) was an American best-selling author and screenwriter. He was known for his heavily researched novels, many with a sexual theme.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'15872': {'pageid': 15872, 'ns': 0, 'title': 'J. R. R. Tolkien', 'extract': 'John Ronald Reuel Tolkien  (, ROOL TOL-keen; 3 January 1892 – 2 September 1973) was an English writer and philologist. He was the author of the high fantasy works The Hobbit and The Lord of the Rings.\nFrom 1925 to 1945, Tolkien was the Rawlinson and Bosworth Professor of Anglo-Saxon and a Fellow of Pembroke College, both at the University of Oxford. He then moved within the same university to become the Merton Professor of English Language and Literature and Fellow of Merton College, and held these positions from 1945 until his retirement in 1959. Tolkien was a close friend of C. S. Lewis, a co-member of the informal literary discussion group The Inklings. He was appointed a Commander of the Order of the British Empire by Queen Elizabeth II on 28 March 1972.\nAfter Tolkien\'s death, his son Christopher published a series of works based on his father\'s extensive notes and unpublished manuscripts, including The Silmarillion. These, together with The Hobbit and The Lord of the Rings, form a connected body of tales, poems, fictional histories, invented languages, and literary essays about a fantasy world called Arda and, within it, Middle-earth. Between 1951 and 1955, Tolkien applied the term legendarium to the larger part of these writings.\nWhile many other authors had published works of fantasy before Tolkien, the great success of The Hobbit and The Lord of the Rings led directly to a popular resurgence of the genre. This has caused him to be popularly identified as the "father" of modern fantasy literature—or, more precisely, of high fantasy.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'1044848': {'pageid': 1044848, 'ns': 0, 'title': 'Masashi Kishimoto', 'extract': 'Masashi Kishimoto (岸本 斉史, Kishimoto Masashi, born November 8,
                    1974) is a Japanese manga artist. His manga series, Naruto, which was in serialization from 1999 to 2014, has sold over 250 million copies worldwide in 46 countries as of May 2019. The series has been adapted into two anime and multiple films, video games, and related media. Besides the Naruto manga, Kishimoto also personally supervised the two canonical anime films, The Last: Naruto the Movie and Boruto: Naruto the Movie, and has written several one-shot stories. In 2019, Kishimoto wrote Samurai 8: The Tale of Hachimaru which ended in March 2020. From May 2016 through October 2020 he supervised the Boruto: Naruto Next Generations manga written by Ukyō Kodachi and illustrated by Mikio Ikemoto. In November 2020 it was announced that he had taken over as writer on the series, replacing Kodachi.A reader of manga from a young age, Kishimoto showed a desire to write his own manga, citing authors Akira Toriyama and Katsuhiro Otomo as his main influences. As a result, Kishimoto spent several years working to write his own shōnen manga for Weekly Shōnen Jump magazine which he was a fan of.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'553716': {'pageid': 553716, 'ns': 0, 'title': 'Gosho Aoyama', 'extract': 'Gosho Aoyama (Japanese: 青山 剛昌, Hepburn: Aoyama Gōshō, born June 21,
                    1963) is a Japanese manga artist best known for his manga series Detective Conan (1994–present), also known as Case Closed in some English-speaking countries. As of 2017, his various manga series had a combined 250 million copies in print worldwide.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'169991': {'pageid': 169991, 'ns': 0, 'title': 'Karl May', 'extract': 'Karl Friedrich May ( MY, German: [kaʁl ˈmaɪ
                    ] (listen); 25 February 1842 – 30 March 1912) was a German author. He is best known for his 19th century novels of fictitious travels and adventures, set in the American Old West with Winnetou and Old Shatterhand as main protagonists and in the Orient and Middle East with fictional characters Kara Ben Nemsi and Hadschi Halef Omar.\nMay also wrote novels set in Latin America, China and Germany, poetry, a play, and composed music; he was a proficient player of several musical instruments. Many of his works were adapted for film, theatre, audio dramas and comics. Later in his career, May turned to philosophical and spiritual genres. He is one of the best-selling German writers of all time, with about 200,
                    000,
                    000 copies sold worldwide.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'9701455': {'pageid': 9701455, 'ns': 0, 'title': 'Carter Brown', 'extract': 'Carter Brown was the literary pseudonym of Alan Geoffrey Yates (1 August 1923 – 5 May 1985), an English-born Australian writer of detective fiction. Between 1954 and 1984 Yates published 215 ‘Carter Brown’ novels and some 75 novella-length stories.\n\n'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'144883': {'pageid': 144883, 'ns': 0, 'title': 'Mickey Spillane', 'extract': 'Frank Morrison Spillane (; March 9,
                    1918 – July 17,
                    2006), better known as Mickey Spillane, was an American crime novelist, whose stories often feature his signature detective character, Mike Hammer. More than 225 million copies of his books have sold internationally. Spillane was also an occasional actor, once even playing Hammer himself.\n\n'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'5813': {'pageid': 5813, 'ns': 0, 'title': 'C. S. Lewis', 'extract': 'Clive Staples Lewis, FBA (29 November 1898 – 22 November 1963) was a British writer and Anglican lay theologian. He held academic positions in English literature at both Oxford University (Magdalen College,
                    1925–1954) and Cambridge University (Magdalene College,
                    1954–1963). He is best known as the author of The Chronicles of Narnia, but he is also noted for his other works of fiction, such as The Screwtape Letters and The Space Trilogy, and for his non-fiction Christian apologetics, including Mere Christianity, Miracles, and The Problem of Pain.\nLewis was a close friend of J. R. R. Tolkien, author of The Lord of the Rings. Both men served on the English faculty at Oxford University and were active in the informal Oxford literary group known as the Inklings. According to Lewis\'s 1955 memoir Surprised by Joy, he was baptized in the Church of Ireland but fell away from his faith during adolescence. Lewis returned to Anglicanism at the age of 32, owing to the influence of Tolkien and other friends, and he became an "ordinary layman of the Church of England". Lewis\'s faith profoundly affected his work, and his wartime radio broadcasts on the subject of Christianity brought him wide acclaim.\nLewis wrote more than 30 books which have been translated into more than 30 languages and have sold millions of copies. The books that make up The Chronicles of Narnia have sold the most and have been popularized on stage, TV, radio, and cinema. His philosophical writings are widely cited by Christian scholars from many denominations.\nIn 1956, Lewis married American writer Joy Davidman; she died of cancer four years later at the age of 45. Lewis died on 22 November 1963 from kidney failure, one week before his 65th birthday. In 2013, on the 50th anniversary of his death, Lewis was honoured with a memorial in Poets\' Corner in Westminster Abbey.\n\n'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'1489948': {'pageid': 1489948, 'ns': 0, 'title': 'Kyotaro Nishimura', 'extract': 'Kyotaro Nishimura (西村 京太郎, Nishimura Kyōtarō,
                    6 September 1930 – 3 March 2022) was a Japanese novelist in the police procedural genre.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'728858': {'pageid': 728858, 'ns': 0, 'title': 'Mitsuru Adachi', 'extract': 'Mitsuru Adachi (Japanese: あだち 充 or 安達 充, Hepburn: Adachi Mitsuru, born February 9,
                    1951) is a Japanese manga artist. After graduating from Gunma Prefectural Maebashi Commercial High School in 1969, Adachi worked as an assistant for Isami Ishii. He made his manga debut in 1970 with Kieta Bakuon, based on a manga originally created by Satoru Ozawa. Kieta was published in Deluxe Shōnen Sunday (a manga magazine published by Shogakukan) .\nAdachi is well known for romantic comedy and sports manga (especially baseball) such as Touch, H2, Slow Step, Miyuki and Cross Game. He has been described as a writer of "delightful dialogue", a genius at portraying everyday life,
                    "the greatest pure storyteller", and "a master manga artist".  He is one of the few manga artists to write for shōnen, shōjo and seinen manga magazines, and be popular in all three.\nHis works have been carried in manga magazines such as Weekly Shōnen Sunday, Ciao, Shōjo Comic, Big Comic and Petit Comic, and most of his works are published through Shogakukan and Gakken. He was one of the flagship authors in the new Monthly Shōnen Sunday magazine which began publication in June 2009. Two short story collections, Short Program and Short Program 2 (both through Viz Media), have been released in North America, and Viz Media scheduled to begin publishing Cross Game in October 2010. The first volume was released on October 12.He modeled the spelling of あだち (rather than 安達) for his family name after the example of his older brother, manga artist Tsutomu Adachi. In addition, it has been suggested that the accurate portrayal of sibling rivalry in Touch may come from Adachi\'s experiences while growing up with his older brother. Adachi did the character designs for the OVA anime series Nozomi Witches, so he is sometimes incorrectly given credit for creating the original series.\n\n'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'26502': {'pageid': 26502, 'ns': 0, 'title': 'Rumiko Takahashi', 'extract': "Rumiko Takahashi (高橋 留美子, Takahashi Rumiko, born October 10, 1957) is a Japanese manga artist. With a career of several commercially successful works, beginning with Urusei Yatsura in 1978, Takahashi is one of Japan's best-known and wealthiest manga artists. Her works are popular worldwide, where they have been translated into a variety of languages, with over 200 million copies in circulation. She has won the Shogakukan Manga Award twice, once in 1980 for Urusei Yatsura and again in 2001 for Inuyasha, and the Seiun Award twice, once in 1987 for Urusei Yatsura and again in 1989 for Mermaid Saga. She also received the Grand Prix de la ville d'Angoulême in 2019, becoming the second woman and second Japanese to win the prize. In 2020, the Japanese government awarded Takahashi the Medal with Purple Ribbon for her contributions to the arts.\n\n"
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'444645': {'pageid': 444645, 'ns': 0, 'title': 'Dan Brown', 'extract': 'Daniel Gerhard Brown (born June 22,
                    1964) is an American author best known for his thriller novels, including the Robert Langdon novels Angels & Demons (2000), The Da Vinci Code (2003), The Lost Symbol (2009), Inferno (2013), and Origin (2017). His novels are treasure hunts that usually take place over a period of 24 hours. They feature recurring themes of cryptography, art, and conspiracy theories. His books have been translated into 57 languages and, as of 2012, have sold over 200 million copies. Three of them, Angels & Demons, The Da Vinci Code, and Inferno, have been adapted into films, while one of them, The Lost Symbol, was adapted into a television show.\nThe Robert Langdon novels are deeply engaged with Christian themes and historical fiction, and have generated controversy as a result. Brown states on his website that his books are not anti-Christian and he is on a "constant spiritual journey" himself. He claims that his book The Da Vinci Code is simply "an entertaining story that promotes spiritual discussion and debate" and suggests that the book may be used "as a positive catalyst for introspection and exploration of our faith."'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'1866203': {'pageid': 1866203, 'ns': 0, 'title': 'Ann M. Martin', 'extract': "Ann Matthews Martin (born August 12, 1955) is an American children's fiction writer, known best for The Baby-Sitters Club series."
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'492042': {'pageid': 492042, 'ns': 0, 'title': 'Ryōtarō Shiba', 'extract': 'Teiichi Fukuda (福田 定一, August 7,
                    1923 – February 12,
                    1996), also known as Ryōtarō Shiba (司馬 遼太郎), was a Japanese author. He is best known for his novels about historical events in Japan and on the Northeast Asian sub-continent, as well as his historical and cultural essays pertaining to Japan and its relationship to the rest of the world.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'62081': {'pageid': 62081, 'ns': 0, 'title': 'Arthur Hailey', 'extract': 'Arthur Frederick Hailey, AE (5 April 1920 – 24 November 2004) was a British-Canadian novelist whose plot-driven storylines were set against the backdrops of various industries. His books, which include such best sellers as Hotel (1965), Airport (1968), Wheels (1971), The Moneychangers (1975), and Overload (1979), have sold 170 million copies in 38 languages.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'66808563': {'pageid': 66808563, 'ns': 0, 'title': 'Koyoharu Gotouge', 'extract': 'Koyoharu Gotouge (Japanese: 吾峠 呼世晴, Hepburn: Gotōge Koyoharu, born May 5,
                    1989) is a Japanese manga artist, known for the manga series Demon Slayer: Kimetsu no Yaiba (2016–2020). As of February 2021, the manga had over 150 million copies in circulation (including digital copies), making it the ninth best-selling manga series of all time.\nGotouge was included as "Phenoms" in Time\'s annual list of 100 Most Influential People, becoming the first manga artist to receive the achievement.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'18951262': {'pageid': 18951262, 'ns': 0, 'title': 'Anne Rice', 'extract': 'Anne Rice (born Howard Allen Frances O\'Brien; October 4,
                    1941 – December 11,
                    2021) was an American author of gothic fiction, erotic literature, and Christian literature.\nShe was best known for her series of novels The Vampire Chronicles. The first book became the subject of a film adaptation—Interview with the Vampire (1994).\nBorn in New Orleans, Rice spent much of her early life in the city before moving to Texas, and later to San Francisco. She was raised in an observant Catholic family but became an agnostic as a young adult. She began her professional writing career with the publication of Interview with the Vampire (1976), while living in California, and began writing sequels to the novel in the 1980s. In the mid-2000s, following a publicized return to Catholicism, Rice published the novels Christ the Lord: Out of Egypt and Christ the Lord: The Road to Cana, fictionalized accounts of certain incidents in the life of Jesus. Several years later she distanced herself from organized Christianity, citing disagreement with the Catholic Church\'s stances on social issues but pledging that faith in God remained "central to [her] life." However, she later considered herself a secular humanist.Rice\'s books have sold over 100 million copies, making her one of the best-selling authors of modern times. While reaction to her early works was initially mixed, she gained a better reception with critics in the 1980s. Her writing style and the literary content of her works have been analyzed by literary commentators. She was married to poet and painter Stan Rice for 41 years, from 1961 until his death from brain cancer in 2002 at age 60. She and Stan had two children, Michele, who died of leukemia at age five, and Christopher, who is also an author.\nIn addition to her vampire novels, Rice authored books such as The Feast of All Saints (adapted for television in 2001) and Servant of the Bones, which formed the basis of a 2011 comic book miniseries. Several books from The Vampire Chronicles have been adapted as comics and manga by various publishers. Rice also authored erotic fiction under the pen names Anne Rampling and A. N. Roquelaure, including Exit to Eden, which was later adapted into a 1994 film.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'3821456': {'pageid': 3821456, 'ns': 0, 'title': 'Gérard de Villiers', 'extract': 'Gérard de Villiers  (French: [ʒeʁaʁ də vilje
                    ]; 8 December 1929 – 31 October 2013) was a French writer, journalist and publisher whose SAS series of spy novels have been major bestsellers.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'4481': {'pageid': 4481, 'ns': 0, 'title': 'Beatrix Potter', 'extract': "Helen Beatrix Potter (, 28 July 1866 – 22 December 1943) was an English writer, illustrator, natural scientist, and conservationist. She is best known for her children's books featuring animals, such as The Tale of Peter Rabbit, which was her first published work in 1902. Her books, including 23 Tales, have sold more than 250 million copies. Potter was also a pioneer of merchandising—in 1903, Peter Rabbit was the first fictional character to be made into a patented stuffed toy, making him the oldest licensed character.Born into an upper-middle-class household, Potter was educated by governesses and grew up isolated from other children. She had numerous pets and spent holidays in Scotland and the Lake District, developing a love of landscape, flora and fauna, all of which she closely observed and painted. Potter's study and watercolours of fungi led to her being widely respected in the field of mycology. In her thirties, Potter self-published the highly successful children's book The Tale of Peter Rabbit. Following this, Potter began writing and illustrating children's books full-time.\nPotter wrote over sixty books, with the best known being her twenty-three children's tales. With the proceeds from the books and a legacy from an aunt, in 1905 Potter bought Hill Top Farm in Near Sawrey, a village in the Lake District. Over the following decades, she purchased additional farms to preserve the unique hill country landscape. In 1913, at the age of 47, she married William Heelis, a respected local solicitor from Hawkshead. Potter was also a prize-winning breeder of Herdwick sheep and a prosperous farmer keenly interested in land preservation. She continued to write and illustrate, and to design spin-off merchandise based on her children's books for British publisher Warne until the duties of land management and her diminishing eyesight made it difficult to continue.\nPotter died of pneumonia and heart disease on 22 December 1943 at her home in Near Sawrey at the age of 77, leaving almost all her property to the National Trust. She is credited with preserving much of the land that now constitutes the Lake District National Park. Potter's books continue to sell throughout the world in many languages with her stories being retold in songs, films, ballet, and animations, and her life is depicted in two films and a television series."
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'20762': {'pageid': 20762, 'ns': 0, 'title': 'Michael Crichton', 'extract': 'John Michael Crichton (; October 23,
                    1942 – November 4,
                    2008) was an American author and filmmaker. His books have sold over 200 million copies worldwide, and over a dozen have been adapted into films. His literary works heavily feature technology and are usually within the science fiction, techno-thriller, and medical fiction genres. His novels often explore technology and failures of human interaction with it, especially resulting in catastrophes with biotechnology. Many of his novels have medical or scientific underpinnings, reflecting his medical training and scientific background.\nCrichton received an M.D. from Harvard Medical School in 1969 but did not practice medicine, choosing to focus on his writing instead. Initially writing under a pseudonym, he eventually wrote 26 novels, including: The Andromeda Strain (1969), The Terminal Man (1972), The Great Train Robbery (1975), Congo (1980), Sphere (1987), Jurassic Park (1990), Rising Sun (1992), Disclosure (1994), The Lost World (1995), Airframe (1996), Timeline (1999), Prey (2002), State of Fear (2004), and Next (2006). Several novels, in various states of completion, were published after his death in 2008.\nCrichton was also involved in the film and television industry. In 1973, he wrote and directed Westworld, the first film to utilize 2D computer-generated imagery. He also directed: Coma (1978), The First Great Train Robbery (1978), Looker (1981), and Runaway (1984). He was the creator of the television series ER (1994–2009), and several of his novels were adapted into films, most notably the Jurassic Park franchise.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'196404': {'pageid': 196404, 'ns': 0, 'title': 'Richard Scarry', 'extract': 'Richard McClure Scarry (June 5,
                    1919 – April 30,
                    1994) was an American children\'s author and illustrator who published over 300 books with total sales of over 100 million worldwide. He is best known for his Best Ever book series that take place primarily in the fictional town of Busytown,
                    "which is populated by friendly and helpful resident [animals...such as] Mr. Frumble, Huckle Cat, Mr. Fixit, Lowly Worm, and others..."  The series spawned a media franchise.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'358192': {'pageid': 358192, 'ns': 0, 'title': 'Clive Cussler', 'extract': 'Clive Eric Cussler (July 15,
                    1931 – February 24,
                    2020) was an American adventure novelist and underwater explorer. His thriller novels, many featuring the character Dirk Pitt, have reached The New York Times fiction best-seller list more than 20 times. Cussler was the founder and chairman of the National Underwater and Marine Agency (NUMA), which has discovered more than 60 shipwreck sites and numerous other notable underwater wrecks. He was the sole author or lead author of more than 80 books.\nHis novels have inspired various other works of fiction.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'261091': {'pageid': 261091, 'ns': 0, 'title': 'Alistair MacLean', 'extract': 'Alistair Stuart MacLean (Scottish Gaelic: Alasdair MacGill-Eain; 21 April 1922 – 2 February 1987) was a 20th-century Scottish novelist who wrote popular thrillers and adventure stories. Many of his novels have been adapted to film, most notably The Guns of Navarone (1957) and Ice Station Zebra (1963). In the late 1960s, encouraged by film producer Elliott Kastner, MacLean began to write original screenplays, concurrently with an accompanying novel. The most successful was the first of these, the 1968 film Where Eagles Dare, which was also a bestselling novel. MacLean also published two novels under the pseudonym Ian Stuart. His books are estimated to have sold over 150 million copies, making him one of the best-selling fiction authors of all time.According to one obituary,
                    "he never lost his love for the sea, his talent for portraying good Brits against bad Germans, or his penchant for high melodrama. Critics deplored his cardboard characters and vapid females, but readers loved his combination of hot macho action, wartime commando sagas, and exotic settings that included Greek Islands and Alaskan oil fields."'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'67160': {'pageid': 67160, 'ns': 0, 'title': 'Ken Follett', 'extract': 'Kenneth Martin Follett,  (born 5 June 1949) is a British author of thrillers and historical novels who has sold more than 160 million copies of his works.Many of his books have achieved high ranking on best seller lists. For example, in the US, many reached the number-one position on the New York Times Best Seller list, including Triple (1979), The Key to Rebecca (1980), Lie Down with Lions (1985), A Dangerous Fortune (1993), World Without End (2007), Fall of Giants (2010), Winter of the World (2012), and Edge of Eternity (2014).\n\n'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'37413': {'pageid': 37413, 'ns': 0, 'title': 'Astrid Lindgren', 'extract': 'Astrid Anna Emilia Lindgren (Swedish: [ˈǎsːtrɪd ˈlɪ̌nːɡreːn
                    ] (listen); née Ericsson; 14 November 1907 – 28 January 2002) was a Swedish writer of fiction and screenplays. She is best known for several children\'s book series, featuring Pippi Longstocking, Emil of Lönneberga, Karlsson-on-the-Roof, and the Six Bullerby Children (Children of Noisy Village in the US), and for the children\'s fantasy novels Mio, My Son, Ronia the Robber\'s Daughter, and The Brothers Lionheart. Lindgren worked on the Children\'s Literature Editorial Board at the Rabén & Sjögren publishing house in Stockholm and wrote more than 30 books for children. In January 2017, she was calculated to be the world\'s 18th most translated author, and the fourth most translated children\'s writer after Enid Blyton, Hans Christian Andersen and the Brothers Grimm. Lindgren has so far sold roughly 167 million books worldwide. In 1994, she was awarded the Right Livelihood Award for "her unique authorship dedicated to the rights of children and respect for their individuality."'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'8515540': {'pageid': 8515540, 'ns': 0, 'title': 'Debbie Macomber', 'extract': "Debbie Macomber (born October 22, 1948) is an American author of romance novels and contemporary women's fiction. Six of her novels have become made-for-TV movies and her Cedar Cove series of novels was adapted into a television series of the same name. Macomber was the inaugural winner of the fan-voted Quill Award for romance in 2005 and has been awarded both a RITA Award and a lifetime achievement award by the Romance Writers of America.She also works as executive producer on the television adaptations of her books."
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'1067338': {'pageid': 1067338, 'ns': 0, 'title': 'Naoki Urasawa', 'extract': "Naoki Urasawa (Japanese: 浦沢 直樹, Hepburn: Urasawa Naoki, born January 2, 1960) is a Japanese manga artist and musician. He has been drawing manga since he was four years old, and for most of his professional career has created two series simultaneously. The stories to many of these were co-written in collaboration with his former editor, Takashi Nagasaki. Urasawa has been called one of the artists that changed the history of manga and has won numerous awards, including the Shogakukan Manga Award three times, the Tezuka Osamu Cultural Prize twice, and the Kodansha Manga Award once. By December 2021, his various works had over 140 million copies in circulation worldwide.\nUrasawa's first major work was illustrating the action series Pineapple Army (1985–1988), which was written by Kazuya Kudo. The first serial that he wrote and illustrated himself, and his first major success, was the sports manga Yawara! (1986–1993). He then illustrated the adventure series Master Keaton (1988–1994), which was written by Hokusei Katsushika and Nagasaki, and created the sports manga Happy! (1993–1999). The thriller Monster (1994–2001) was his first to receive international acclaim and success, which continued with the science fiction mystery 20th Century Boys (1999–2006). Following the acclaimed Pluto (2003–2009), which is a re-imagining of Astro Boy by Osamu Tezuka, one of Urasawa's biggest influences, he and Nagasaki created the mystery series Billy Bat (2008–2016). After two short series, a sequel to Master Keaton with Nagasaki and Mujirushi: The Sign of Dreams, Urasawa began his currently ongoing Asadora! in 2018."
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'36815898': {'pageid': 36815898, 'ns': 0, 'title': 'EL James', 'extract': ''
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'1186218': {'pageid': 1186218, 'ns': 0, 'title': 'Tite Kubo', 'extract': 'Noriaki Kubo (Japanese: 久保 宣章, Hepburn: Kubo Noriaki, born June 26,
                    1977), known professionally as Tite Kubo (久保 帯人, Kubo Taito), is a Japanese manga artist and character designer. He is best known for his manga series Bleach (2001–2016), which had over 130 million copies in circulation as of 2022.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'315864': {'pageid': 315864, 'ns': 0, 'title': 'Eiji Yoshikawa', 'extract': 'Eiji Yoshikawa (吉川 英治, Yoshikawa Eiji, August 11,
                    1892 – September 7,
                    1962) was a Japanese historical novelist. Among his best-known novels are revisions of older classics. He was mainly influenced by classics such as The Tale of the Heike, Tale of Genji, Water Margin and Romance of the Three Kingdoms, many of which he retold in his own style. As an example, Yoshikawa took up Taiko\'s original manuscript in 15 volumes to retell it in a more accessible tone and reduce it to only two volumes. His other books also serve similar purposes and, although most of his novels are not original works, he created a huge amount of work and a renewed interest in the past. He was awarded the Cultural Order of Merit in 1960 (the highest award for a man of letters in Japan), the Order of the Sacred Treasure and the Mainichi Art Award just before his death from cancer in 1962. He is cited as one of the best historical novelists in Japan. The complete translation of his "Miyamoto Musashi", in the west, is only available in Portuguese\n\n'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'905516': {'pageid': 905516, 'ns': 0, 'title': 'Catherine Cookson', 'extract': 'Dame Catherine Ann Cookson, DBE (née McMullen; 20 June 1906 – 11 June 1998) was a British writer. She is in the top 20 of the most widely read British novelists, with sales topping 100 million, while retaining a relatively low profile in the world of celebrity writers. Her books were inspired by her deprived youth in South Shields (historically part of County Durham), North East England, the setting for her novels. With 104 titles written in her own name or two other pen names, she is one of the most prolific British novelists.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'4484462': {'pageid': 4484462, 'ns': 0, 'title': 'Stephenie Meyer', 'extract': 'Stephenie Meyer (; née Morgan; born December 24,
                    1973) is an American novelist and film producer. She is best known for writing the vampire romance series Twilight, which has sold over 100 million copies, with translations into 37 different languages. Meyer was the bestselling author of 2008 and 2009 in the U.S., having sold over 29 million books in 2008, and 26.5 million in 2009. Meyer received the 2009 Children\'s Book of the Year award from the British Book Awards for Breaking Dawn, the Twilight series finale.\nAn avid young reader, she attended Brigham Young University, marrying at the age of twenty-one before graduating with a degree in English in 1997. Having no prior experience as an author, she conceived the idea for the Twilight series in a dream. Influenced by the work of Jane Austen and William Shakespeare, she wrote Twilight soon thereafter. After many rejections, Little, Brown and Company offered her a $750,
                    000 three-book deal which led to a four-book series, several spin-off novels and novellas, and a series of commercially successful film adaptations. Aside from young adult novels, Meyer has ventured into adult novels with The Host (2008) and The Chemist (2016). Meyer has worked in film production and cofounded production company Fickle Fish Films. Meyer produced both parts of Breaking Dawn and two other novel adaptations.\nMeyer\'s membership in the Church of Jesus Christ of Latter-day Saints (LDS Church) shaped her novels. Themes consistent with her religion, including agency, mortality, temptation, and eternal life, are prominent in her work. Meyer\'s work has been criticized for her overly-simplistic writing style. Meyer\'s stories have also received praise and she has acquired a fan following.\nMeyer was included on Time magazine\'s list of the "100 Most Influential People in 2008", and was included in the Forbes Celebrity 100 list of the world\'s most powerful celebrities in 2009, with her annual earnings exceeding $50 million.\n\n'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'4835925': {'pageid': 4835925, 'ns': 0, 'title': 'Norman Bridwell', 'extract': 'Norman Ray Bridwell (February 15,
                    1928 – December 12,
                    2014) was an American author and cartoonist best known for the Clifford the Big Red Dog book series.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'904063': {'pageid': 904063, 'ns': 0, 'title': 'David Baldacci', 'extract': 'David Baldacci (born August 5,
                    1960) is an American novelist. An attorney by education, Baldacci writes mainly suspense novels and legal thrillers.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'679409': {'pageid': 679409, 'ns': 0, 'title': 'Nicholas Sparks', 'extract': 'Nicholas Charles Sparks (born December 31,
                    1965) is an American novelist, screenwriter, and film producer. He has published twenty-three novels, all New York Times bestsellers, and two works of non-fiction, with over 115 million copies sold worldwide in more than 50 languages. Among his works are The Notebook, A Walk to Remember, and Message in a Bottle which, along with 8 other books by Sparks, have been adapted as feature films.Sparks lives in North Carolina, where many of his novels are set.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'1791248': {'pageid': 1791248, 'ns': 0, 'title': 'Hirohiko Araki', 'extract': "Hirohiko Araki (荒木 飛呂彦, Araki Hirohiko, born June 7, 1960) is a Japanese manga artist. He is best known for his long-running series JoJo's Bizarre Adventure, which began publication in Weekly Shōnen Jump in 1987 and has over 120 million copies in circulation, making it one of the best-selling manga series in history."
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'311359': {'pageid': 311359, 'ns': 0, 'title': 'Evan Hunter', 'extract': 'Evan Hunter, born Salvatore Albert Lombino, (October 15,
                    1926 – July 6,
                    2005) was an American author and screenwriter best known for his 87th Precinct novels, written under his Ed McBain pen name, and the novel upon which the film Blackboard Jungle was based.\nHunter, who legally adopted that name in 1952, also used the pen names John Abbott, Curt Cannon, Hunt Collins, Ezra Hannon, and Richard Marsten, among others. His 87th Precinct novels have become staples of the police procedural genre.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'1254202': {'pageid': 1254202, 'ns': 0, 'title': 'Andrew Neiderman', 'extract': "Andrew Neiderman (born October 26, 1940) is a best-selling American novelist.  In 1987, he became the ghost writer for V. C. Andrews following her death in 1986. He formerly taught English at Fallsburg Jr./Sr. High School, in upstate New York.\nNeiderman is arguably best known as the author of The Devil's Advocate, later adapted into a film starring Keanu Reeves, Al Pacino, and Charlize Theron, and directed by Taylor Hackford. Neiderman also adapted the novel Rain into a film, based on a series of novels released under Andrews's name.\nNeiderman wrote the stage adaptation of Flowers in the Attic based on the novel by V.C. Andrews, published online in 2014. The world premiere was produced in New Orleans, Louisiana, in August 2015 by See 'Em On Stage: A Production Company and was directed by Christopher Bentivegna.\nAndrew Neiderman has written the libretto for a musical stage adaptation of The Devil's Advocate.He also co-authored the screenplay for Duplicates, a USA Network cable movie, and has had six of his other novels adapted into films.\nWith the publication of Guardian Angel by Dorchester Publishers in January 2010, Neiderman has, between his V. C. Andrews novels and those under his name, reached 125 published novels.\nA resident of Palm Springs, California, Neiderman was honored with a Golden Palm Star on the Palm Springs Walk of Stars on October 17, 1997.\n\n"
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'576772': {'pageid': 576772, 'ns': 0, 'title': 'Roger Hargreaves', 'extract': "Charles Roger Hargreaves (9 May 1935 – 11 September 1988) was an English author and illustrator of children's books. He created the Mr. Men series, Little Miss series and  Timbuctoo series, intended for young readers. The simple and humorous stories, with bold, brightly coloured illustrations, have sales of over 85 million copies worldwide in 20 languages. The first title in the series, Mr. Tickle, was published in August 1971."
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'186803': {'pageid': 186803, 'ns': 0, 'title': 'Robin Cook', 'extract': 'Robert Finlayson "Robin" Cook (28 February 1946 – 6 August 2005) was a British Labour politician who served as a Member of Parliament (MP) from 1974 until his death in 2005 and served in the Cabinet as Foreign Secretary from 1997 until 2001 when he was replaced by Jack Straw. He then served as Leader of the House of Commons from 2001 until 2003.\nHe studied at the University of Edinburgh before being elected as the Member of Parliament for Edinburgh Central in 1974; he switched to the Livingston constituency in 1983. In Parliament, he was known for his debating ability and rapidly rose through the political ranks and ultimately into the Cabinet. As Foreign Secretary, he oversaw British interventions in Kosovo and Sierra Leone.\nHe resigned from his positions as Lord President of the Council and Leader of the House of Commons on 17 March 2003 in protest against the invasion of Iraq. At the time of his death, he was President of the Foreign Policy Centre and a Vice-President of the America All Party Parliamentary Group and the Global Security and Non-Proliferation All Party Parliamentary Group.\n\n'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'498574': {'pageid': 498574, 'ns': 0, 'title': 'Wilbur Smith', 'extract': 'Wilbur Addison Smith (9 January 1933 – 13 November 2021) was a Zambian-born British-South African novelist specialising in historical fiction about international involvement in Southern Africa across four centuries.\nAn accountant by training, he gained a film contract with his first published novel When the Lion Feeds. This encouraged him to become a full-time writer, and he developed three long chronicles of the South African experience which all became best-sellers. He acknowledged his publisher Charles Pick\'s advice to "write about what you know best", and his work takes in much authentic detail of the local hunting and mining way of life, along with the romance and conflict that goes with it. \nBy the time of his death in 2021 he had published 49 books of which he sold over 140 million copies,
                    24 million of them in Italy (by 2014).'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'499968': {'pageid': 499968, 'ns': 0, 'title': 'Erskine Caldwell', 'extract': "Erskine Preston Caldwell (December 17, 1903 – April 11, 1987) was an American novelist and short story writer. His writings about poverty, racism and social problems in his native Southern United States, in novels such as Tobacco Road (1932) and God's Little Acre (1933) won him critical acclaim. \nWith cumulative sales of 10 million and 14 million copies, respectively, Tobacco Road and God's Little Acre rank as two of the best-selling American novels, all-time, with the former being adapted into a 1933 play that set a Broadway record for consecutive performances, since surpassed."
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'701677': {'pageid': 701677, 'ns': 0, 'title': 'Judith Krantz', 'extract': 'Judith Krantz (née Tarcher; January 9,
                    1928 – June 22,
                    2019) was a magazine writer and fashion editor who turned to fiction as she approached the age of 50. Her first novel Scruples (1978) quickly became a New York Times best-seller and went on to be a worldwide publishing success, translated into 50 languages. Scruples, which describes the glamorous and affluent world of high fashion in Beverly Hills, California, helped define a new supercharged sub-genre of the romance novel - the bonkbuster or "sex-and-shopping" novel. She also fundamentally changed the publishing industry by becoming one of the first celebrity authors through her extensive touring and promotion - "a superstar of fiction". Her later books included Princess Daisy (1980), Till We Meet Again (1988), Dazzle (1990) and Spring Collection (1996).  Her autobiography, Sex and Shopping: The Confessions of a Nice Jewish Girl, was published in 2000.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'68049624': {'pageid': 68049624, 'ns': 0, 'title': 'Eleanor Hibbert', 'extract': ''
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'26586083': {'pageid': 26586083, 'ns': 0, 'title': 'Lewis Carroll', 'extract': 'Charles Lutwidge Dodgson ( LUT-wij DOJ-sən; 27 January 1832 – 14 January 1898), better known by his pen name Lewis Carroll, was an English author, poet and mathematician. His most notable works are Alice\'s Adventures in Wonderland (1865) and its sequel Through the Looking-Glass (1871). He was noted for his facility with word play, logic, and fantasy. His poems Jabberwocky (1871) and The Hunting of the Snark (1876) are classified in the genre of literary nonsense.\nCarroll came from a family of high-church Anglicans, and developed a long relationship with Christ Church, Oxford, where he lived for most of his life as a scholar and teacher. Alice Liddell, the daughter of Christ Church\'s dean Henry Liddell, is widely identified as the original inspiration for Alice in Wonderland, though Carroll always denied this.\nAn avid puzzler, Carroll created the word ladder puzzle (which he then called "Doublets"), which he published in his weekly column for Vanity Fair magazine between 1879 and 1881. In 1982 a memorial stone to Carroll was unveiled at Poets\' Corner in Westminster Abbey. There are societies in many parts of the world dedicated to the enjoyment and promotion of his works.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'16756124': {'pageid': 16756124, 'ns': 0, 'title': 'Denise Robins', 'extract': "Denise Robins (née Denise Naomi Klein; 1 February 1897 – 1 May 1985) was a prolific English romantic novelist and the first President of the Romantic Novelists' Association (1960–1966). She wrote under her first married name and under the pen-names: Denise Chesterton, Eve Vaill, 'Anne Llewellyn', Hervey Hamilton, Francesca Wright, Ashley French, Harriet Gray and Julia Kane, producing short stories, plays, and about 170 Gothic romance novels. In 1965, Robins published her autobiography, Stranger Than Fiction. At the time of her death in 1985, Robins's books had been translated into fifteen languages and had sold more than one hundred million copies. In 1984, they were borrowed more than one and a half million times from British libraries.She was the daughter of the novelist K. C. Groom, and mother of romance novelist Patricia Robins. Some other members of her family are well-known artists."
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'295094': {'pageid': 295094, 'ns': 0, 'title': 'Cao Xueqin', 'extract': "Cáo Xuěqín ([tsʰǎʊ ɕɥètɕʰǐn] tsow sh'weh-chin; Chinese: 曹雪芹); (4 April 1710 — 10 June 1765) was a Chinese novelist and poet.  during the Qing dynasty.  He is best known as the author of Dream of the Red Chamber, one of the Four Great Classical Novels of Chinese literature. His given name was Cáo Zhān  (曹霑) and his courtesy name was Mèngruǎn (simplified Chinese: 梦阮; traditional Chinese: 夢阮)."
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'57985': {'pageid': 57985, 'ns': 0, 'title': 'Ian Fleming', 'extract': 'Ian Lancaster Fleming (28 May 1908 – 12 August 1964) was a British writer, best known for his postwar James Bond series of spy novels. Fleming came from a wealthy family connected to the merchant bank Robert Fleming & Co., and his father was the Member of Parliament (MP) for Henley from 1910 until his death on the Western Front in 1917. Educated at Eton, Sandhurst, and, briefly, the universities of Munich and Geneva, Fleming moved through several jobs before he started writing.\nWhile working for Britain\'s Naval Intelligence Division during the Second World War, Fleming was involved in planning Operation Goldeneye and in the planning and oversight of two intelligence units,
                    30 Assault Unit and T-Force. He drew from his wartime service and his career as a journalist for much of the background, detail, and depth of his James Bond novels.\nFleming wrote his first Bond novel, Casino Royale, in 1952. It was a success, with three print runs being commissioned to cope with the demand. Eleven Bond novels and two collections of short stories followed between 1953 and 1966. The novels revolve around James Bond, an officer in the Secret Intelligence Service, commonly known as MI6. Bond is also known by his code number,
                    007, and was a commander in the Royal Naval Volunteer Reserve. The Bond stories rank among the best-selling series of fictional books of all time, having sold over 100 million copies worldwide. Fleming also wrote the children\'s story Chitty-Chitty-Bang-Bang and two works of non-fiction. In 2008, The Times ranked Fleming 14th on its list of "The 50 greatest British writers since 1945".\nFleming was married to Ann Charteris. She had divorced her husband, the 2nd Viscount Rothermere, because of her affair with the author. Fleming and Charteris had a son, Caspar. Fleming was a heavy smoker and drinker for most of his life and succumbed to heart disease in 1964 at the age of 56. Two of his James Bond books were published posthumously; other writers have since produced Bond novels. Fleming\'s creation has appeared in film twenty-seven times, portrayed by seven actors.\n\n'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'13578': {'pageid': 13578, 'ns': 0, 'title': 'Hermann Hesse', 'extract': "Hermann Karl Hesse (German: [ˈhɛʁman ˈhɛsə] (listen); 2 July 1877 – 9 August 1962) was a German-Swiss poet, novelist, and painter. His best-known works include Francis of Assisi, Demian, Steppenwolf, Siddhartha, and The Glass Bead Game, each of which explores an individual's search for authenticity, self-knowledge and spirituality. In 1946, he received the Nobel Prize in Literature.\n\n"
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'144369': {'pageid': 144369, 'ns': 0, 'title': 'Rex Stout', 'extract': "Rex Todhunter Stout (; December 1, 1886 – October 27, 1975) was an American writer noted for his detective fiction. His best-known characters are the detective Nero Wolfe and his assistant Archie Goodwin, who were featured in 33 novels and 39 novellas between 1934 and 1975.\nIn 1959, Stout received the Mystery Writers of America's Grand Master Award. The Nero Wolfe corpus was nominated Best Mystery Series of the Century at Bouchercon XXXI, the world's largest mystery convention, and Rex Stout was nominated Best Mystery Writer of the Century.\nIn addition to writing fiction, Stout was a prominent public intellectual for decades. Stout was active in the early years of the American Civil Liberties Union and a founder of the Vanguard Press. He served as head of the Writers' War Board during World War II, became a radio celebrity through his numerous broadcasts, and was later active in promoting world federalism. He was the long-time president of the Authors Guild, during which he sought to benefit authors by lobbying for reform of the domestic and international copyright laws, and served a term as president of the Mystery Writers of America."
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'5037324': {'pageid': 5037324, 'ns': 0, 'title': 'Anne Golon', 'extract': 'Anne Golon (17 December 1921 – 14 July 2017) was a French author, better known to English-speaking readers as Sergeanne Golon. Her Angélique novels have reportedly sold 150 million copies worldwide and have inspired multiple adaptations.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'2515653': {'pageid': 2515653, 'ns': 0, 'title': 'Frank G. Slaughter', 'extract': 'Frank Gill Slaughter (February 25,
                    1908 – May 17,
                    2001), pen-name Frank G. Slaughter, pseudonym C.V. Terry, was an American novelist and physician whose books sold more than 60 million copies. His novels drew on his own experience as a doctor and his interest in history and the Bible. Through his novels, he often introduced readers to new findings in medical research and new medical technologies.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'9657': {'pageid': 9657, 'ns': 0, 'title': 'Edgar Rice Burroughs', 'extract': "Edgar Rice Burroughs (September 1, 1875 – March 19, 1950) was an American writer, best known for his prolific output in the adventure, science fiction, and fantasy genres. Best-known for creating the characters Tarzan and John Carter, he also wrote the Pellucidar series, the Amtor series, and the Caspak trilogy. \nTarzan was immediately popular, and Burroughs capitalized on it in every way possible, including a syndicated Tarzan comic strip, movies, and merchandise. Tarzan remains one of the most successful fictional characters to this day and is a cultural icon. Burroughs's California ranch is now the center of the Tarzana neighborhood in Los Angeles, named after the character. Burroughs was an explicit supporter of eugenics and scientific racism in both his fiction and nonfiction; Tarzan was meant to reflect these concepts.\n\n"
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'1371792': {'pageid': 1371792, 'ns': 0, 'title': 'John Creasey', 'extract': "John Creasey  (17 September 1908 – 9 June 1973) was an English crime writer, also writing science fiction, romance and western novels, who wrote more than six hundred novels using twenty-eight different pseudonyms.\nHe created several characters who are now famous, such as The Toff (The Honourable Richard Rollison), Commander George Gideon of Scotland Yard, Inspector Roger West, The Baron (John Mannering), Doctor Emmanuel Cellini and Doctor Stanislaus Alexander Palfrey. The most popular of these was Gideon of Scotland Yard, who was the basis for the television series Gideon's Way and for the John Ford movie  Gideon's Day (1958). The Baron character was also made into a 1960s TV series starring Steve Forrest as The Baron."
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'227124': {'pageid': 227124, 'ns': 0, 'title': 'James A. Michener', 'extract': "James Albert Michener ( or ; February 3, 1907 – October 16, 1997) was an American writer. He wrote more than 40 books, most of which were long, fictional family sagas covering the lives of many generations in particular geographic locales and incorporating detailed history. Many of his works were bestsellers and were chosen by the Book of the Month Club; he was known for the meticulous research that went into his books.Michener's books include Tales of the South Pacific, for which he won the Pulitzer Prize for Fiction in 1948; Hawaii; The Drifters; Centennial; The Source; The Fires of Spring; Chesapeake; Caribbean; Caravans; Alaska; Texas; Space; Poland; and The Bridges at Toko-ri. His non-fiction works include Iberia, about his travels in Spain and Portugal; his memoir, The World Is My Home; and Sports in America. Return to Paradise combines fictional short stories with Michener's factual descriptions of the Pacific areas where they take place.His first book was adapted as the popular Broadway musical South Pacific, by Rodgers and Hammerstein, and later as eponymous feature films in 1958 and 2001, adding to his financial success. A number of his other stories and novels were adapted for films and TV series.\nHe also wrote Presidential Lottery: The Reckless Gamble in Our Electoral System, in which he condemned the United States' Electoral College system. It was published in 1969, and republished in 2014 and 2016."
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'72142480': {'pageid': 72142480, 'ns': 0, 'title': 'Yasuo Uchida', 'extract': 'Yasuo Uchida was a Japanese author who is one of the best-selling fiction authors and his works has been sold more than 500 million copies. 115 million copies of his book has published.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'1251523': {'pageid': 1251523, 'ns': 0, 'title': 'Seiichi Morimura', 'extract': 'Seiichi Morimura (森村 誠一, Morimura Seiichi, born January 2,
                    1933) is a Japanese novelist and author, born in Kumagaya. He is best known for the controversial The Devil\'s Gluttony (悪魔の飽食) (1981), which revealed the atrocities committed by Unit 731 of the Imperial Japanese Army during the Sino-Japanese War (1937–1945).The Devil\'s Gluttony was serialized in the Akahata (Japanese Communist Party\'s newspaper) in 1980, and subsequently published by Kobunsha (光文社), in two volumes in 1981 and 1982. In the ensuing controversy, half of a photograph was discovered to be a fabrication, and Kobunsha subsequently withdrew the book. A second edition was then published by Kadokawa Shoten in 1983 with the controversial photograph removed.He won the Edogawa Rampo Prize in 1969 for Death in the High-Rise (高層の死角).His short story "Devil of a Boy" appears translated into English in Ellery Queen\'s Japanese Golden Dozen: The Detective Story World in Japan anthology, which was edited by Ellery Queen.\n\n'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'479225': {'pageid': 479225, 'ns': 0, 'title': 'Mary Higgins Clark', 'extract': "Mary Higgins Clark (born Mary Theresa Eleanor Higgins (December 24, 1927 – January 31, 2020) was an American author of suspense novels. Each of her 51 books was a bestseller in the United States and various European countries, and all of her novels remained in print as of 2015, with her debut suspense novel, Where Are the Children?, in its seventy-fifth printing.\nHiggins Clark began writing at an early age. After several years working as a secretary and copy editor, she spent a year as a stewardess for Pan-American Airlines before leaving her job to marry and start a family. She supplemented the family's income by writing short stories. After her husband died in 1964, Higgins Clark worked for many years writing four-minute radio scripts until her agent persuaded her to try writing novels. Her debut novel, a fictionalized account of the life of George Washington, did not sell well, and she decided to exploit her love of mystery/suspense novels. Her suspense novels became very popular, and have sold more than 100 million copies in the United States alone. Her daughter Carol Higgins Clark and former daughter-in-law Mary Jane Clark, are also writers."
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'8502001': {'pageid': 8502001, 'ns': 0, 'title': 'Penny Jordan', 'extract': "Penelope Halsall (née Jones; 24 November 1946 – 31 December 2011) was a best-selling and prolific English writer of over 200 romance novels. She started writing regency romances as Caroline Courtney, and wrote contemporary romances as Penny Jordan and historical romances as Annie Groves (her mother's maiden name). She also wrote novels as Melinda Wright and Lydia Hitchcock. Her books have sold over 70 million copies worldwide and been translated into many languages.\n\n"
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'170947': {'pageid': 170947, 'ns': 0, 'title': 'Patricia Cornwell', 'extract': 'Patricia Cornwell (born Patricia Carroll Daniels; June 9,
                    1956) is an American crime writer. She is known for her best-selling novels featuring medical examiner Kay Scarpetta, of which the first was inspired by a series of sensational murders in Richmond, Virginia, where most of the stories are set. The plots are notable for their emphasis on forensic science, which has influenced later TV treatments of police work. Cornwell has also initiated new research into the Jack the Ripper killings, incriminating the popular British artist Walter Sickert. Her books have sold more than 100 million copies.'
                }
            }
        }
    },
    {'batchcomplete': '', 'query': {'pages': {'39456699': {'pageid': 39456699, 'ns': 0, 'title': 'Hajime Isayama', 'extract': 'Hajime Isayama (諫山 創, Isayama Hajime, born August 29,
                    1986) is a Japanese manga artist. His first series, Attack on Titan (2009–2021), became one of the best-selling manga series of all time with 110 million copies in circulation as of September 2022.'
                }
            }
        }
    }
]